; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v5 ?v8)
		(pred_3 ?v4)
		(pred_1 ?v6)
		(pred_5 ?v6)
		(pred_6 ?v4 ?v6)
		(pred_2)
		(pred_4 ?v4))

   (:action op_2
       :parameters  (?v3 ?v7)
       :precondition (and (not-eq ?v3 ?v7) 
                          (pred_1 ?v3) (pred_1 ?v7) (pred_5 ?v3))
       :effect (and  (pred_5 ?v7)
		     (not (pred_5 ?v3))))


   (:action op_3
       :parameters (?v1 ?v2)
       :precondition  (and  (pred_3 ?v1) (pred_1 ?v2)
			    (pred_6 ?v1 ?v2) (pred_5 ?v2) (pred_2))
       :effect (and (pred_4 ?v1)
		    (not (pred_6 ?v1 ?v2)) 
		    (not (pred_2))))

   (:action op_1
       :parameters  (?v1  ?v2)
       :precondition  (and  (pred_3 ?v1) (pred_1 ?v2)
			    (pred_4 ?v1) (pred_5 ?v2))
       :effect (and (pred_6 ?v1 ?v2)
		    (pred_2)
		    (not (pred_4 ?v1)))))

; problem
(define (problem ferry-l3-c3)
(:domain ferry)
(:objects obj_06 obj_01 obj_03 
          obj_04 obj_05 obj_02 
)
(:init
(pred_1 obj_06)
(pred_1 obj_01)
(pred_1 obj_03)
(pred_3 obj_04)
(pred_3 obj_05)
(pred_3 obj_02)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_03)
(not-eq obj_03 obj_06)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_01)
(pred_2)
(pred_6 obj_04 obj_06)
(pred_6 obj_05 obj_03)
(pred_6 obj_02 obj_03)
(pred_5 obj_06)
)
(:goal
(and
(pred_6 obj_04 obj_06)
(pred_6 obj_05 obj_01)
(pred_6 obj_02 obj_06)
)
)

(:constraints
  (and
    (sometime-before  (pred_6 obj_05 obj_01) (pred_5 obj_06))
    (sometime-before  (pred_6 obj_02 obj_06) (pred_5 obj_01))
  )
)
)

; plan
1. (op_2 obj_06 obj_03)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_03)
   goals met: 1 of 3
2. (op_3 obj_05 obj_03)
   deleted: (pred_6 obj_05 obj_03) (pred_2)
   added: (pred_4 obj_05)
   goals met: 1 of 3
3. (op_2 obj_03 obj_01)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_01)
   goals met: 1 of 3
4. (op_1 obj_05 obj_01)
   deleted: (pred_4 obj_05)
   added: (pred_6 obj_05 obj_01) (pred_2)
   goals met: 2 of 3
5. (op_2 obj_01 obj_03)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_03)
   goals met: 2 of 3
6. (op_3 obj_02 obj_03)
   deleted: (pred_6 obj_02 obj_03) (pred_2)
   added: (pred_4 obj_02)
   goals met: 2 of 3
7. (op_2 obj_03 obj_06)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_06)
   goals met: 2 of 3
8. (op_1 obj_02 obj_06)
   deleted: (pred_4 obj_02)
   added: (pred_6 obj_02 obj_06) (pred_2)
   goals met: 3 of 3
